---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NotOneLoop
source: html/b9b405a5-9a1f-84f2-bbfb-0d3818a974dd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NotOneLoop Property

More than one loop not allowed.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotOneLoop { get; }
```